apim-migration-testing-tool-rest-assured/src/test/payloads/demoAddUserRequest_Creator.xml

<!--
 ~ Copyright (c) 2022, WSO2 Inc. (http://www.wso2.org) All Rights Reserved.
 ~
 ~ WSO2 Inc. licenses this file to you under the Apache License,
 ~ Version 2.0 (the "License"); you may not use this file except
 ~ in compliance with the License.
 ~ You may obtain a copy of the License at
 ~
 ~ http://www.apache.org/licenses/LICENSE-2.0
 ~
 ~ Unless required by applicable law or agreed to in writing,
 ~ software distributed under the License is distributed on an
 ~ "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY
 ~ KIND, either express or implied. See the License for the
 ~ specific language governing permissions and limitations
 ~ under the License.
-->

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ser="http://service.ws.um.carbon.wso2.org" xmlns:xsd="http://common.mgt.user.carbon.wso2.org/xsd">
   <soapenv:Header/>
   <soapenv:Body>
      <ser:addUser>
         <!--Optional:-->
         <ser:userName>creator2_Test</ser:userName>
         <!--Optional:-->
         <ser:credential>creator2_Test</ser:credential>
         <!--Zero or more repetitions:-->
         <ser:roleList>admin</ser:roleList>
         <ser:roleList>creatorTest</ser:roleList>
         <!--Zero or more repetitions:-->
         <ser:claims>
            <!--Optional:-->
            <xsd:claimURI>http://wso2.org/claims/country</xsd:claimURI>
            <!--Optional:-->
            <xsd:value>England</xsd:value>
         </ser:claims>
         <ser:claims>
            <!--Optional:-->
            <xsd:claimURI>http://wso2.org/claims/organization</xsd:claimURI>
            <!--Optional:-->
            <xsd:value>Intuit</xsd:value>
         </ser:claims>
         <!--Optional:-->
         <ser:profileName>creator2_Test_ProfileName</ser:profileName>
         <!--Optional:-->
         <ser:requirePasswordChange>false</ser:requirePasswordChange>
      </ser:addUser>
   </soapenv:Body>
</soapenv:Envelope>